const x = [
    'زندگی با تعداد نفس‌ هایی که می‌ کشیم سنجیده نمی‌ شود،بلکه با لحظاتی که نفس مان را بند می آورند سنجیده می‌ شود ',
    'زندگی را فقط می توان رو به عقب درک کرد، اما باید رو به جلو زندگی کرد',
    'و در نهایت، اینکه چند سال زندگی کردید مهم نیست اینکه در آن چند سال، چقدر زندگی کردید مهم است ',
    'شما، به اندازه هر کس در کل جهان، لایق عشق و محبت خودتان هستید',
    'زندگی بدون عشق مانند درختی است بدون شکوفه و میوه',
    'فقط یک فکر مثبت کوچک هنگام صبح می تواند کل روز شما را تغییر دهد',
    'برای بسیاری از افراد، کسب ثروت مشکلات آن ها را پایان نمی دهد، بلکه آن ها را تغییر می دهد'
]

const changeX = document.getElementById(`x`)

function y() {
    const randomN = Math.floor(Math.random() * x.length)
    changeX.innerText = x[randomN]
}